class Text:
    start = '<b>👋 أهلاً، {user}!</b> من خلال هذا البوت يمكنك تنظيم عملية الشراء التلقائي للهدايا الجديدة في <b>Telegram Gifts</b>.'
    profile = (
        '<b>📄 ملف المستخدم {user}</b>\n\n'
        '<b>- المعرف (ID): </b><code>{id}</code>\n'
        '<b>- الرصيد: </b><code>{balance}</code> ⭐\n'
        '<b>- VIP:</b> {status_vip}\n\n'
        '<i>مع اشتراك VIP يتم تقليل فترة فحص الهدايا الجديدة من <b>{default_interval}</b> إلى <b>{vip_interval}</b> ثانية!</i>'
    )
    info = (
        '📡 <b>معلومات نظام المراقبة</b>\n\n'
        '- <b>تاريخ التشغيل:</b> <code>{startup_date}</code>\n'
        '- <b>عدد المستخدمين:</b> <code>{user_count}</code>\n'
        '- <b>النجوم في البنك:</b> <code>{storage}</code> ⭐\n'
        '- <b>عدد الهدايا المرسلة:</b> <code>{all_buy}</code> 🎁\n'
        '- <b>فترة الفحص لديك:</b> <code>{interval}</code> ثانية.\n\n'
        'يقوم البوت تلقائيًا بمتابعة ظهور الهدايا الجديدة وشرائها لك إذا كان لديك عدد كافٍ من النجوم في الرصيد.\n'
        'يُنصح بالاحتفاظ على الأقل بـ 20 ⭐ في الرصيد لضمان نجاح شراء الهدايا الجديدة (مع ذلك، سعر الهدايا الجديدة غير معروف مسبقًا).\n\n'
        '<i>يمكن أن تظهر الهدايا الجديدة في أي وقت من اليوم، لذلك يعمل البوت على مدار الساعة.</i>\n'
    )
    info_setting = (
        '<b>⚙️ في هذه القائمة اضغط على الزر أدناه لاختيار/تغيير وضع شراء الهدايا الجديدة</b>'
    )
    get_amount = '<b>💳 أدخل مبلغ شحن الرصيد بالنجوم ⭐</b>'
    invoice_emoji = '🌟'
    success_invoice_emoji = '🥳'
    successful_invoice = '<b>✅ تم شحن رصيدك، لضبط الشراء التلقائي للهدايا انتقل إلى قسم <i>المعلومات</i></b>'
    vip_text = (
        '<b>🚄 VIP - اشترِ الهدايا قبل الجميع</b>\n\n'
        '<b>بفضل الاشتراك، بمجرد صدور هدية جديدة، من المرجح أن تحصل عليها قبل المستخدمين العاديين للبوت</b>\n\n'
        '<i>الاشتراك يُدفع مرة واحدة ويستمر مدى الحياة لهذا الحساب، وسعر الاشتراك هو <b>{}</b> ⭐</i>'
    )
    in_development = 'هذا العنصر قيد التطوير'
    success_buy_vip = '✅ <b>مبروك! أنت الآن مستخدم VIP.</b>'

    class errors:
        not_integer = '<b>❌ يرجى إدخال رقم صحيح</b>'
        invoice_reject = "فاتورة شحن الرصيد لم تعد صالحة"
        insufficient_funds = "ليس لديك عدد كافٍ من النجوم لدفع اشتراك VIP. يرجى شحن الرصيد."
        already_buy = '🤝 لديك بالفعل اشتراك VIP'

    class utils:
        bool_to_emoji = lambda status: '✅' if status else '❌'